first_routes/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
    def index #action
        # render plain: "I'm in the index action!"
        users = User.all

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Big Bird"], ["email", "bigbird@google.com"], ["created_at", "2019-01-29 01:23:00.617123"], ["updated_at", "2019-01-29 01:23:00.617123"]]
---
    def create
        user = User.new(params.require(:user).permit(:name, :email))
        if user.save